-- MySQL dump 10.13  Distrib 8.0.31, for Win64 (x86_64)
--
-- Host: 43.200.152.213    Database: simollu
-- ------------------------------------------------------
-- Server version	8.0.31

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `user_fork_log`
--

DROP TABLE IF EXISTS `user_fork_log`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user_fork_log` (
  `user_fork_seq` bigint NOT NULL AUTO_INCREMENT,
  `user_fork_amount` int DEFAULT NULL,
  `user_fork_balance` int DEFAULT NULL,
  `user_fork_content` varchar(255) DEFAULT NULL,
  `user_fork_register_date` datetime(6) DEFAULT NULL,
  `user_fork_type` varchar(255) DEFAULT NULL,
  `user_seq` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`user_fork_seq`)
) ENGINE=InnoDB AUTO_INCREMENT=72 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_fork_log`
--

LOCK TABLES `user_fork_log` WRITE;
/*!40000 ALTER TABLE `user_fork_log` DISABLE KEYS */;
INSERT INTO `user_fork_log` VALUES (1,10,10,'회원 가입','2023-05-10 01:35:31.406890','적립','a186dfd5-5e55-4978-bbb3-ea7322577152'),(2,10,10,'회원 가입','2023-05-10 02:07:11.751955','적립','2b804e99-1a97-4c94-a63d-21bdbbc0d91a'),(3,10,10,'회원 가입','2023-05-10 02:14:20.102061','적립','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(4,10,10,'회원 가입','2023-05-10 03:53:31.734319','적립','43ccce9b-7210-4c7c-a43b-ded38a1fd1b5'),(5,10,10,'회원 가입','2023-05-10 04:21:05.137112','적립','8a5e742f-01ca-4fd0-8e17-27d7ed2e3112'),(6,10,10,'회원 가입','2023-05-10 04:22:03.818526','적립','6f3c0699-19ce-4dcd-ba40-21dcc3785c11'),(7,10,10,'회원 가입','2023-05-11 00:22:44.346361','적립','9b5be44a-3ddf-4d09-9479-0aea43da907f'),(8,5,15,'그냥 받음','2023-05-11 00:28:32.940904','적립','8a5e742f-01ca-4fd0-8e17-27d7ed2e3112'),(9,5,20,'그냥 받음','2023-05-11 00:29:04.923305','적립','8a5e742f-01ca-4fd0-8e17-27d7ed2e3112'),(10,10,10,'회원 가입','2023-05-11 00:59:14.054226','적립','9030f201-c3a3-4ff9-a411-2359392b65e0'),(11,5,25,'그냥 받음','2023-05-11 00:59:59.028606','적립','8a5e742f-01ca-4fd0-8e17-27d7ed2e3112'),(12,5,30,'그냥 받음','2023-05-11 02:03:04.941896','적립','8a5e742f-01ca-4fd0-8e17-27d7ed2e3112'),(14,5,35,'그냥 받음','2023-05-11 16:17:11.627806','적립','8a5e742f-01ca-4fd0-8e17-27d7ed2e3112'),(15,-1,9,'순서 미루기','2023-05-12 10:21:39.000000','사용','43ccce9b-7210-4c7c-a43b-ded38a1fd1b5'),(16,1,10,'리뷰 작성','2023-05-12 10:21:52.000000','적립','43ccce9b-7210-4c7c-a43b-ded38a1fd1b5'),(17,10,10,'회원 가입','2023-05-15 07:29:31.506924','적립','7f4da6a4-cc59-4eef-a9ab-ce91f88ad82e'),(18,1,36,'리뷰 작성','2023-05-18 13:53:20.748810','적립','8a5e742f-01ca-4fd0-8e17-27d7ed2e3112'),(19,1,11,'리뷰 작성','2023-05-18 14:06:13.214234','적립','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(20,1,12,'리뷰 작성','2023-05-18 14:11:19.440640','적립','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(21,1,13,'리뷰 작성','2023-05-18 14:30:07.449706','적립','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(22,1,14,'리뷰 작성','2023-05-18 14:32:20.450449','적립','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(23,1,11,'리뷰 작성','2023-05-18 14:44:59.963004','적립','6f3c0699-19ce-4dcd-ba40-21dcc3785c11'),(24,-1,13,'웨이팅 신청','2023-05-18 14:47:09.557790','사용','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(25,-1,9,'웨이팅 신청','2023-05-18 14:54:38.198962','사용','7f4da6a4-cc59-4eef-a9ab-ce91f88ad82e'),(26,1,10,'웨이팅 취소','2023-05-18 14:55:10.772738','적립','7f4da6a4-cc59-4eef-a9ab-ce91f88ad82e'),(27,1,14,'리뷰 작성','2023-05-18 15:01:23.054339','적립','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(28,1,15,'리뷰 작성','2023-05-18 15:01:34.568222','적립','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(29,1,16,'웨이팅 취소','2023-05-18 15:02:28.243376','적립','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(30,-1,35,'웨이팅 신청','2023-05-18 15:03:02.607982','사용','8a5e742f-01ca-4fd0-8e17-27d7ed2e3112'),(31,-1,15,'웨이팅 신청','2023-05-18 15:03:15.799526','사용','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(32,-1,10,'웨이팅 신청','2023-05-18 15:04:08.040536','사용','6f3c0699-19ce-4dcd-ba40-21dcc3785c11'),(33,1,11,'웨이팅 취소','2023-05-18 15:04:45.842312','적립','6f3c0699-19ce-4dcd-ba40-21dcc3785c11'),(34,-1,10,'웨이팅 신청','2023-05-18 15:05:04.456686','사용','6f3c0699-19ce-4dcd-ba40-21dcc3785c11'),(35,1,16,'리뷰 작성','2023-05-18 15:50:11.897188','적립','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(36,-1,15,'웨이팅 신청','2023-05-18 16:06:18.193438','사용','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(37,1,16,'리뷰 작성','2023-05-18 16:08:50.406687','적립','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(38,-1,15,'웨이팅 신청','2023-05-18 16:25:21.305540','사용','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(39,-1,14,'웨이팅 신청','2023-05-18 16:34:08.700069','사용','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(40,1,15,'리뷰 작성','2023-05-18 16:36:14.342620','적립','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(41,-1,34,'웨이팅 신청','2023-05-18 16:44:28.649124','사용','8a5e742f-01ca-4fd0-8e17-27d7ed2e3112'),(42,-1,14,'웨이팅 신청','2023-05-18 16:44:47.870978','사용','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(43,-1,9,'웨이팅 신청','2023-05-18 16:45:40.406866','사용','6f3c0699-19ce-4dcd-ba40-21dcc3785c11'),(44,1,10,'웨이팅 취소','2023-05-18 16:45:47.188623','적립','6f3c0699-19ce-4dcd-ba40-21dcc3785c11'),(45,-1,13,'웨이팅 신청','2023-05-18 17:44:23.567595','사용','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(46,1,14,'리뷰 작성','2023-05-18 17:46:04.795123','적립','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(47,-1,13,'웨이팅 신청','2023-05-18 17:54:05.870630','사용','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(48,1,14,'웨이팅 취소','2023-05-18 17:56:14.848543','적립','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(49,-1,13,'웨이팅 신청','2023-05-18 18:20:03.243358','사용','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(50,1,14,'리뷰 작성','2023-05-18 18:21:42.677384','적립','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(51,-1,13,'웨이팅 신청','2023-05-18 18:31:12.937032','사용','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(52,1,14,'리뷰 작성','2023-05-18 18:32:47.103152','적립','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(53,1,35,'리뷰 작성','2023-05-18 19:36:58.803649','적립','8a5e742f-01ca-4fd0-8e17-27d7ed2e3112'),(54,1,36,'리뷰 작성','2023-05-18 19:43:06.581376','적립','8a5e742f-01ca-4fd0-8e17-27d7ed2e3112'),(55,1,37,'리뷰 작성','2023-05-18 22:44:11.021877','적립','8a5e742f-01ca-4fd0-8e17-27d7ed2e3112'),(56,1,38,'리뷰 작성','2023-05-18 22:44:24.422415','적립','8a5e742f-01ca-4fd0-8e17-27d7ed2e3112'),(57,1,39,'리뷰 작성','2023-05-18 22:44:32.501576','적립','8a5e742f-01ca-4fd0-8e17-27d7ed2e3112'),(58,1,40,'리뷰 작성','2023-05-18 22:44:58.818598','적립','8a5e742f-01ca-4fd0-8e17-27d7ed2e3112'),(59,1,41,'리뷰 작성','2023-05-18 22:45:28.127615','적립','8a5e742f-01ca-4fd0-8e17-27d7ed2e3112'),(60,1,42,'리뷰 작성','2023-05-18 22:45:47.148922','적립','8a5e742f-01ca-4fd0-8e17-27d7ed2e3112'),(61,-1,41,'웨이팅 신청','2023-05-18 22:55:53.899844','사용','8a5e742f-01ca-4fd0-8e17-27d7ed2e3112'),(62,1,42,'리뷰 작성','2023-05-18 23:04:19.030766','적립','8a5e742f-01ca-4fd0-8e17-27d7ed2e3112'),(63,-1,13,'웨이팅 신청','2023-05-19 00:06:31.490544','사용','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(64,-1,12,'웨이팅 신청','2023-05-19 00:09:52.639572','사용','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(65,1,13,'리뷰 작성','2023-05-19 00:11:36.400181','적립','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(66,-1,12,'웨이팅 신청','2023-05-19 00:23:36.815265','사용','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(67,1,13,'리뷰 작성','2023-05-19 00:25:19.928728','적립','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(68,-1,12,'웨이팅 신청','2023-05-19 01:13:56.407896','사용','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(69,1,13,'리뷰 작성','2023-05-19 01:15:31.005164','적립','2537e7bd-61db-49da-a4c8-d9ab360e05a6'),(70,-1,9,'웨이팅 신청','2023-05-19 01:33:53.870947','사용','6f3c0699-19ce-4dcd-ba40-21dcc3785c11'),(71,-1,12,'웨이팅 신청','2023-05-19 01:35:16.526744','사용','2537e7bd-61db-49da-a4c8-d9ab360e05a6');
/*!40000 ALTER TABLE `user_fork_log` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-05-19 10:55:55
